#include<stdio.h>
int main()
{
    double x;
    scanf("%lf",&x);
    double y;
    if(x<5&&x>=0)
    {
        y=-x+2.5;
    }
    if(x<10&&x>=5)
    {
        y=2-1.5*(x-3)*(x-3);
    }
    if(x<20&&x>=10)
    {
       y=x/2.0-1.5;
    }
    printf("%.3lf",y);
    return 0;
}
// 分段函数
// 描述
// 编写程序，计算下列分段函数y=f(x)的值。

// y=-x+2.5; （x小于5且大于等于0）

// y=2-1.5(x-3)(x-3); （x小于10且大于等于5）

// y=x/2-1.5; （x小于20且大于等于10）

// 格式
// 输入格式
// 一个浮点数N。

// 输出格式
// 输出N对应的分段函数值：f(N)。结果保留到小数点后三位。

// 样例
// 输入样例
// 1.0
// 输出样例
// 1.500